app/controllers/urls_controller.rb

SELECT "urls".* FROM "urls"
---
  def index
    @urls = Url.all

SELECT  "urls".* FROM "urls" WHERE "urls"."code" = ? LIMIT ?  [["code", "sarasa"], ["LIMIT", 1]]
---
  def stats
    @url = Url.find_by_code(params[:code])

UPDATE "urls" SET "last_usage" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["last_usage", "2017-07-13 16:17:36.164431"], ["updated_at", "2017-07-13 16:17:36.172996"], ["id", 1]]
---
  def show
    @url.last_usage = DateTime.now
    @url.save

UPDATE "urls" SET "url" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["url", "http://www.yahoo.com"], ["updated_at", "2017-07-13 04:27:54.773257"], ["id", 1]]
---
  def update
    @url.update(url_params)

DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 1]]
---
  def destroy
    @url.destroy

SELECT  "urls".* FROM "urls" WHERE "urls"."code" = ? LIMIT ?  [["code", "code"], ["LIMIT", 1]]
UPDATE "urls" SET "views_count" = COALESCE("views_count", 0) + 1 WHERE "urls"."id" = ?  [["id", 2]]
---
  def show_by_code
    @url = Url.find_by_code(params[:code])
    Url.increment_counter(:views_count, @url.id)

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_url
    @url = Url.find(params[:id])