app/controllers/urls_controller.rb

INSERT INTO "urls" ("url", "code", "created_at", "updated_at", "views_count") VALUES (?, ?, ?, ?, ?)  [["url", "http://www.google.com"], ["code", "a1b2c3d4e5"], ["created_at", "2017-07-13 14:12:11.285613"], ["updated_at", "2017-07-13 14:12:11.285613"], ["views_count", 0]]
---
  def create
    url = Url.create(url_params)